In [53]:
import pandas as pd

In [55]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [57]:
##1) Display top 3 rows of the dataset
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [59]:
##2) Display last 3 rows of the dataset
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [71]:
##3)Find the shape of the dataset(number of rows and colums)
df1.shape
print("rows",df1.shape[0])
print("columns",df1.shape[1])

rows 7
columns 3

In [75]:
## 4) get info about our dataset like total number rows, total number of columns, datatypes of each column an dmemory requirement
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [85]:
## 5) Check null values in dataset
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [83]:
## 6) get overall statistics about the dataframe
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [89]:
##7) find unique values from the gender column
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [93]:
##8) find number of unique values from the gender column
df1['Gender'].nunique()

2

In [97]:
##9) count of unique values from the gender column
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [103]:
##10) find total number of students having marjke bet 90 to 100(inc) using between method
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [105]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [107]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [113]:
sum(df1['Marks'].between(90,100))

4

In [115]:
##11) Find Average marks
df1['Marks'].mean()

92.14285714285714

In [121]:
##12) Apply Method
def marks(x):
    return x/2

In [125]:
df1['HalfMarks']=df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  HalfMarks
0  Priyang     98    Male       49.0
1   Aadhya     89  Female       44.5
2   Krisha     99  Female       49.5
3   Vedant     87    Male       43.5
4   Parshv     90    Male       45.0
5   Mittal     83  Female       41.5
6  Archana     99  Female       49.5

In [129]:
##13) Map Function
df1['Male_Female']=df1["Gender"].map({'Male':1,'Female':0})

In [131]:
df1

      Name  Marks  Gender  HalfMarks  Male_Female
0  Priyang     98    Male       49.0            1
1   Aadhya     89  Female       44.5            0
2   Krisha     99  Female       49.5            0
3   Vedant     87    Male       43.5            1
4   Parshv     90    Male       45.0            1
5   Mittal     83  Female       41.5            0
6  Archana     99  Female       49.5            0

In [139]:
##14) Drop the columnsdf1
df1

      Name  Marks  Gender  HalfMarks  Male_Female
0  Priyang     98    Male       49.0            1
1   Aadhya     89  Female       44.5            0
2   Krisha     99  Female       49.5            0
3   Vedant     87    Male       43.5            1
4   Parshv     90    Male       45.0            1
5   Mittal     83  Female       41.5            0
6  Archana     99  Female       49.5            0

In [137]:
df1.drop('Male_Female',axis=1)

      Name  Marks  Gender  HalfMarks
0  Priyang     98    Male       49.0
1   Aadhya     89  Female       44.5
2   Krisha     99  Female       49.5
3   Vedant     87    Male       43.5
4   Parshv     90    Male       45.0
5   Mittal     83  Female       41.5
6  Archana     99  Female       49.5

In [143]:
df1.drop(['Male_Female','HalfMarks'],axis=1,inplace=True)

In [145]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female